tests/load-tests/load-test.yml
config:
  target: 'http://localhost:4200'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 30
      name: "Sustained load"
    - duration: 60
      arrivalRate: 10
      name: "Ramp down"
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "User Registration Flow"
    weight: 20
    flow:
      - get:
          url: "/"
          name: "Home Page"
      - post:
          url: "/api/auth/register"
          name: "User Registration"
          json:
            firstName: "Load Test User {{ $randomInt(1, 1000) }}"
            lastName: "Test"
            email: "loadtest{{ $randomInt(1, 1000) }}@example.com"
            phone: "+5255{{ $randomInt(10000000, 99999999) }}"
            password: "Test123!"
            confirmPassword: "Test123!"
            role: "buyer"
            acceptTerms: true
      - get:
          url: "/verify-email?token=mock-token"
          name: "Email Verification"

  - name: "User Login Flow"
    weight: 30
    flow:
      - get:
          url: "/login"
          name: "Login Page"
      - post:
          url: "/api/auth/login"
          name: "User Login"
          json:
            email: "buyer@test.com"
            password: "Test123!"
      - get:
          url: "/dashboard"
          name: "Dashboard"

  - name: "Transaction Creation Flow"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          name: "Login for Transaction"
          json:
            email: "seller@test.com"
            password: "Test123!"
      - get:
          url: "/dashboard"
          name: "Dashboard"
      - post:
          url: "/api/transactions"
          name: "Create Transaction"
          json:
            itemName: "Load Test Item {{ $randomInt(1, 1000) }}"
            itemDescription: "Item for load testing"
            itemPrice: {{ $randomInt(1000, 50000) }}
            currency: "MXN"
            category: "Electronics"
            condition: "Nuevo"
            inspectionPeriod: 3
            buyerEmail: "buyer@test.com"

  - name: "Transaction Management Flow"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          name: "Login for Management"
          json:
            email: "buyer@test.com"
            password: "Test123!"
      - get:
          url: "/api/transactions"
          name: "Get Transactions"
      - get:
          url: "/api/transactions/1"
          name: "Get Transaction Details"
      - put:
          url: "/api/transactions/1/status"
          name: "Update Transaction Status"
          json:
            new_status: "accepted"

  - name: "Payment Processing Flow"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          name: "Login for Payment"
          json:
            email: "buyer@test.com"
            password: "Test123!"
      - post:
          url: "/api/payments"
          name: "Process Payment"
          json:
            transactionId: 1
            amount: 35000
            currency: "MXN"
            paymentMethod: "credit_card"
            cardNumber: "4242424242424242"
            expiryMonth: "12"
            expiryYear: "2025"
            cvv: "123"
            cardholderName: "Test User"